#include<iostream>
#include<string>


using namespace std;

int main()
{
	cout << "1234567890123456789\n";
	//字符串被显示在宽度等于该字符串长度的字段中
	char ch = 'K';
	int t = 273;
	cout << ch << ":\n";
	//char型被作为一个字符显示在宽度为一个字符的字段中

	cout << t << ":\n";
	//整型以十进制方式显示在一个刚好容纳该数字及负号（如果有的话）的字段中
	cout << -t << ":\n";

	double f1 = 1.200;
	cout << f1 << ":\n";
	//浮点型数字后面的0不显示
	cout << (f1 + 1.0 / 9.0) << ":\n";
	//浮点型默认6位有效数字

	double f2 = 1.67E2;
	//科学计数法1.67 X 10^2--十的二次方
	//E和e都可以，还可以e+2--十的正二次方，e-2--十的负二次方
	cout << f2 << ":\n";
	f2 += 1.0 / 9.0;
	cout << f2 << ":\n";
	//浮点型默认6位有效数字
	cout << (f2 * 1.0e4) << ":\n";
	//当指数大于等于6或小于等于-5时，将使用科学计数法表示：167.111 * 1.0 * 10^4,十的指数等于6了，使用了科学计数法

	double f3 = 2.3e-4;
	cout << f3 << ":\n";
	//10的指数为-4，直接显示--浮点型默认6位有效数字
	cout << f3 / 10 << ":\n";
	//10的指数为-5，使用了科学计数法



	


	system("pause");
	return 0;
}